app/controllers/api/conversations_controller.rb

    def index
        @conversations = Conversation.all
---
SELECT "conversations".* FROM "conversations"

    def show
        @conversation = Conversation.find(params[:id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]