app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "full_name", "status", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        #user signup
        @user = User.new(user_params)
        @user.full_name = user_params[:email]
        @user.status = 1
        puts (@user)
        if @user.save