app/views/api/conversations/_conversation.json.jbuilder

    json.extract! conversation, :id, :name, :description, :admin_id, :is_private, :conversation_type
    json.last_message conversation.messages.last
---
SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["conversation_id", 3], ["LIMIT", 1]]