app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "YeRJr8kscEEhSy5QzarFQQ"], ["updated_at", "2020-08-18 19:19:30.606675"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = new_session_token
        self.save!